IOsonata/IOsonata/ARM/Nordic/nRF52/src/usb_ctrlr_nrf52.cpp
/** Retire active DMA before a foreground stop or endpoint close. */
void nRFUsbdDmaWait(void)
{
	while (nRFUsbdDmaActive())
	{
		if (NRF_USBD->EVENTS_USBRESET != 0U)
		{
			nRFUsbdDmaUnlock();
			return;
		}

		const uint32_t dmaStatus = NRF_USBD->EPSTATUS & 0x00FF00FFUL;
		const uint32_t primask = __get_PRIMASK();
		__disable_irq();
		bool complete = false;
		if (dmaStatus != 0U)
		{
			complete = nRFUsbdRetireDma(31U - (uint32_t)__CLZ(dmaStatus));
		}
		else
		{
			complete = nRFUsbdIsoFinishDma(0U);
		}
		if (complete)
			nRFUsbdDmaUnlock();
		__set_PRIMASK(primask);
	}
}

// Program and start one staged EP0 IN packet, arming the status-stage short
// when the packet is short. The caller already owns EasyDMA.
static __attribute__((noinline)) void nRFUsbdEp0InStart(const nRFEPPkt_t *p)
{
	NRF_USBD->EPIN[0].PTR = (uint32_t)(uintptr_t)p->Payload;
	NRF_USBD->EPIN[0].MAXCNT = p->Len;
	NRF_USBD->SHORTS = p->Len < NRFX_USBD_MAX_PACKET_SIZE ?
		USBD_SHORTS_EP0DATADONE_EP0STATUS_Msk : 0U;
	nRFUsbdDmaStartLocked(&NRF_USBD->TASKS_STARTEPIN[0],
		&NRF_USBD->EVENTS_ENDEPIN[0]);
}

// The SOF interrupt is shared: application SOF events, open ISO endpoints
// and suspend-time resume detection all need it. Acquire clears a stale
// event first; release drops it only when nothing needs it anymore.
__attribute__((noinline)) void nRFUsbdSofAcquire(void)
{
	NRF_USBD->EVENTS_SOF = 0U;
	NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
}

__attribute__((noinline)) void nRFUsbdSofRelease(void)
{
	if (!s_Usbd.SofEnabled && !s_Usbd.IsoOpen &&
		(s_Usbd.Flags & USBD_FLAG_SUSPENDED) == 0U)
	{
		NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
	}
}

/**
 * Start EasyDMA for one regular queued request. Endpoint number and
 * direction stay separate in the scheduler; what an OUT endpoint actually
 * holds is only known now, so that is read here.
 */
static inline __attribute__((always_inline))
void nRFUsbdStartDmaNow(const nRFUsbdQue_t *pQue)
{
	const uint8_t epNum = pQue->EpNum;
	const bool isIn = pQue->Dir != NRFX_USBD_QUE_OUT;
	const uint8_t *pBuffer;

	if (pQue->Dir == NRFX_USBD_QUE_IN_SCRATCH)
	{
		pBuffer = (const uint8_t *)&pQue->Scratch;
	}
	else
	{
		pBuffer = pQue->pBuffer;
	}

	uint16_t len = pQue->Len;

	// Both directions use the same layout, at different register-bank offsets.
	uintptr_t epReg = (uintptr_t)&NRF_USBD->EPIN[epNum];
	uintptr_t taskReg = (uintptr_t)&NRF_USBD->TASKS_STARTEPIN[epNum];
	if (!isIn)
	{
		const uint16_t received = (uint16_t)NRF_USBD->SIZE.EPOUT[epNum];
		if (received < len)
			len = received;
		epReg += offsetof(NRF_USBD_Type, EPOUT) - offsetof(NRF_USBD_Type, EPIN);
		taskReg += offsetof(NRF_USBD_Type, TASKS_STARTEPOUT) -
			offsetof(NRF_USBD_Type, TASKS_STARTEPIN);
	}
	volatile USBD_EPIN_Type *pEp = (volatile USBD_EPIN_Type *)epReg;
	volatile uint32_t *pTask = (volatile uint32_t *)taskReg;
	pEp->PTR = (uint32_t)(uintptr_t)pBuffer;
	pEp->MAXCNT = len;
	*pTask = 1U;
	__DSB();
}

static inline __attribute__((always_inline)) bool nRFUsbdDmaAllowed(void)
{
	return (s_Usbd.Flags &
		(USBD_FLAG_SUSPENDED | USBD_FLAG_HOST_RESUME)) == 0U;
}

// Callers check the power gate and own the channel lock. EP0 starts
// separately in its submission path or the ISR completion handoff.
static __attribute__((noinline)) void nRFUsbdStartQueuedDma(void)
{
	if (nRFUsbdIsoStart != nullptr && nRFUsbdIsoStart())
		return;
	nRFUsbdQue_t *pQue = (nRFUsbdQue_t *)CFifoPeek(s_Usbd.hQue);
	if (pQue != NULL)
	{
		nRFUsbdStartDmaNow(pQue);
		return;
	}
	nRFUsbdDmaUnlock();
}


// Submission acquires an idle channel; completion retains the existing lock.
__attribute__((noinline)) void nRFUsbdResumeQueuedDmaLocked(void)
{
	if (nRFUsbdDmaActive() || !nRFUsbdDmaAllowed())
		return;

	nRFUsbdDmaLock();
	nRFUsbdStartQueuedDma();
}

static void nRFUsbdResetState(void)
{
	s_Usbd.SofEnabled = false;
	s_Usbd.IsoOpen = false;
	s_Usbd.IsoBufState = 0U;

	CFifoFlush(s_Usbd.hQue);
	CFifoFlush(s_Usbd.hEp0Que);
	s_Usbd.Flags = USBD_FLAG_MAC_AWAKE;
	NRF_USBD->EVENTS_EP0SETUP = 0U;
	NRF_USBD->EVENTS_EP0DATADONE = 0U;
	nRFUsbdDmaUnlock();
}

static void nRFUsbdAbortEp0(void)
{
	const uint32_t state = DisableInterrupt();
	CFifoFlush(s_Usbd.hEp0Que);
	EnableInterrupt(state);

	NRF_USBD->EVENTS_ENDEPIN[0] = 0;
	NRF_USBD->EVENTS_ENDEPOUT[0] = 0;
	NRF_USBD->EPDATASTATUS = (1UL << 0) | (1UL << 16);
	(void)NRF_USBD->EPDATASTATUS;
}

// ISR context only: this interrupt is the sole mutator of the wake state,
// so no interrupt exclusion is needed here.
static void nRFUsbdTryEnterLowPower(void)
{
	const uint8_t entryMask = USBD_FLAG_SUSPENDED | USBD_FLAG_REMOTE_WAKE |
		USBD_FLAG_HOST_RESUME;
	if (!s_Usbd.LowPowerSuspend ||
		(s_Usbd.Flags & entryMask) != USBD_FLAG_SUSPENDED ||
		nRFUsbdDmaActive())
	{
		return;
	}

	if ((NRF_USBD->EVENTCAUSE & USBD_EVENTCAUSE_RESUME_Msk) != 0U ||
		NRF_USBD->EVENTS_SOF != 0U)
	{
		nRFUsbdHostResumeDetected();
		return;
	}

	s_Usbd.Flags &= (uint8_t)~USBD_FLAG_MAC_AWAKE;
	NRF_USBD->LOWPOWER =
		USBD_LOWPOWER_LOWPOWER_LowPower << USBD_LOWPOWER_LOWPOWER_Pos;
	(void)NRF_USBD->LOWPOWER;

	if ((NRF_USBD->EVENTCAUSE & USBD_EVENTCAUSE_RESUME_Msk) != 0U ||
		NRF_USBD->EVENTS_SOF != 0U)
	{
		nRFUsbdHostResumeDetected();
	}
}

static void nRFUsbdTryRemoteWake(void)
{
	const uint8_t wakeMask = USBD_FLAG_REMOTE_WAKE | USBD_FLAG_SUSPENDED |
		USBD_FLAG_HOST_RESUME | USBD_FLAG_MAC_AWAKE;
	const uint8_t wakeWant = USBD_FLAG_REMOTE_WAKE | USBD_FLAG_SUSPENDED |
		USBD_FLAG_MAC_AWAKE;
	const uint8_t flags = s_Usbd.Flags;
	if ((flags & wakeMask) != wakeWant ||
		nRFUsbdDmaActive() ||
		!UsbdIsForceNormal())
	{
		return;
	}

	s_Usbd.Flags = flags & (uint8_t)~USBD_FLAG_REMOTE_WAKE;
	NRF_USBD->DPDMVALUE = USBD_DPDMVALUE_STATE_Resume;
	NRF_USBD->TASKS_DPDMDRIVE = 1;
	(void)NRF_USBD->TASKS_DPDMDRIVE;

	if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
	{
		NRF_USBD->EVENTS_SOF = 0;
	}
	NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
}

static void nRFUsbdHostResumeDetected(void)
{
	const uint32_t irqState = DisableInterrupt();
	uint8_t flags = s_Usbd.Flags;

	if ((flags & USBD_FLAG_SUSPENDED) == 0U)
	{
		EnableInterrupt(irqState);
		return;
	}

	const bool waking = (flags & USBD_FLAG_MAC_AWAKE) == 0U || !UsbdIsForceNormal();
	flags &= (uint8_t)~(USBD_FLAG_SUSPENDED | USBD_FLAG_REMOTE_WAKE |
		USBD_FLAG_HOST_RESUME);
	if (waking)
		flags |= USBD_FLAG_HOST_RESUME;
	s_Usbd.Flags = flags;
	EnableInterrupt(irqState);

	if (waking)
		UsbdForceNormal();
	else
		nRFUsbdEmitSimple(USB_CTRLR_EVT_RESUME);
}

