IOsonata/IOsonata/ARM/Nordic/nRF52/src/usb_ctrlr_nrf52.cpp
// ISR context only.
static void nRFUsbdWakeAllowed(void)
{
	const uint8_t flags = s_Usbd.Flags;
	s_Usbd.Flags = (flags | USBD_FLAG_MAC_AWAKE) &
		(uint8_t)~USBD_FLAG_HOST_RESUME;
	if ((flags & USBD_FLAG_HOST_RESUME) != 0U)
		nRFUsbdEmitSimple(USB_CTRLR_EVT_RESUME);
}

static void nRFUsbdBusReset(void)
{
	NRF_USBD->EPOUTEN = 1UL;
	NRF_USBD->EPINEN = 1UL;

	// START tasks are write-1 triggers, not state to clear on reset.
	const uint32_t epStatus = NRF_USBD->EPSTATUS;
	NRF_USBD->EPSTATUS = epStatus;
	const uint32_t dataStatus = NRF_USBD->EPDATASTATUS;
	NRF_USBD->EPDATASTATUS = dataStatus;

	NRF_USBD->EVENTS_USBEVENT = 0;
	const uint32_t cause = NRF_USBD->EVENTCAUSE;
	NRF_USBD->EVENTCAUSE = cause;

	NRF_USBD->INTENCLR = NRF_USBD->INTEN;
	NRF_USBD->INTENSET =
		USBD_INTEN_USBRESET_Msk |
		USBD_INTEN_USBEVENT_Msk |
		USBD_INTEN_EPDATA_Msk |
		USBD_INTEN_EP0SETUP_Msk |
		USBD_INTEN_EP0DATADONE_Msk |
		USBD_INTEN_ENDEPOUT0_Msk;

	nRFUsbdResetState();
}

static void nRFUsbdProcessInComplete(uint32_t Evt, void *pContext)
{
	(void)pContext;

	// This callback handles IN; the event carries only the endpoint number.
	nRFUsbEpRegisteredEvent((uint8_t)Evt, 1U,
		USB_CTRLR_EVT_XFER_CMPL, (uint16_t)(Evt >> 8U));
}


static void nRFUsbdProcessOutData(uint32_t Evt, void *pContext)
{
	const uint8_t epNum = (uint8_t)Evt;
	(void)pContext;

	const uint32_t state = DisableInterrupt();
	const uint32_t bit = 1UL << (epNum + 16U);
	// A latched OUT bit owns the request until DMA can be queued. AppEvt
	// retries may overlap; only the first accepted enqueue consumes it.
	// Wait for the previous DMA's completion ISR before reusing its buffer.
	// That callback may need to withhold the buffer when RX is full.
	if ((NRF_USBD->EPDATASTATUS & bit) != 0U &&
		(NRF_USBD->EPSTATUS & bit) == 0U)
	{
		nRFUsbEpReg_t *pReg = nRFUsbGetEpReg(epNum, 0U);
		if (pReg->pBuffer != NULL)
		{
			nRFUsbdQue_t *pQue = (nRFUsbdQue_t *)CFifoPut(s_Usbd.hQue);
			if (pQue != NULL)
			{
				pQue->EpNum = epNum;
				pQue->Dir = NRFX_USBD_QUE_OUT;
				pQue->Len = pReg->MaxPacketSize;
				pQue->pBuffer = pReg->pBuffer;
				// Acknowledge before DMA can admit the next packet.
				NRF_USBD->EPDATASTATUS = bit;
				__DSB();
				nRFUsbdResumeQueuedDmaLocked();
			}
			else
			{
				// Retry queue pressure, not a withheld RX buffer.
				(void)AppEvtHandlerQue(epNum, NULL, nRFUsbdProcessOutData);
			}
		}
	}
	EnableInterrupt(state);
}

// InData is nonzero. Return only the status bit accepted by AppEvt; a full
// queue leaves it in EPDATASTATUS for UsbCtrlrProcess to retry.
static __attribute__((noinline))
uint32_t nRFUsbdQueueInComplete(uint32_t InData)
{
	const uint32_t epNum = 31U - (uint32_t)__CLZ(InData);
	const uint32_t evt = (NRF_USBD->EPIN[epNum].AMOUNT << 8U) | epNum;
	return (uint32_t)AppEvtHandlerQue(evt, NULL, nRFUsbdProcessInComplete) << epNum;
}

static void nRFUsbdHandleBusEvent(uint32_t EventCause)
{
	if ((EventCause & USBD_EVENTCAUSE_SUSPEND_Msk) != 0U &&
		(s_Usbd.Flags & USBD_FLAG_SUSPENDED) == 0U)
	{
		// A bus suspend and a peripheral low-power transition are separate.
		// When low-power suspend is disabled, retain all endpoint state and
		// wait for RESUME or SOF without touching USBD LOWPOWER.
		s_Usbd.Flags = (s_Usbd.Flags &
			(uint8_t)~(USBD_FLAG_REMOTE_WAKE | USBD_FLAG_HOST_RESUME)) |
			USBD_FLAG_SUSPENDED;
		s_Usbd.IsoBufState &=
			(uint8_t)~(NRFUSBD_ISO_IN_READY | NRFUSBD_ISO_OUT_READY);
		nRFUsbdSofAcquire();
		nRFUsbdEmitSimple(USB_CTRLR_EVT_SUSPEND);
	}

	if ((EventCause & USBD_EVENTCAUSE_RESUME_Msk) != 0)
	{
		nRFUsbdHostResumeDetected();
	}

	if ((EventCause & USBD_EVENTCAUSE_USBWUALLOWED_Msk) != 0)
	{
		nRFUsbdWakeAllowed();
	}
}

static void nRFUsbdHandleSof(void)
{
	nRFUsbdHostResumeDetected();

	nRFUsbdIsoSof();

	if (s_Usbd.SofEnabled)
	{
		UsbCtrlrEvt_t evt;
		evt.Type = USB_CTRLR_EVT_SOF;
		evt.FrameNo = (uint16_t)NRF_USBD->FRAMECNTR;
		UsbDevProcessEvent(0, &evt);
	}

	nRFUsbdSofRelease();

	nRFUsbdResumeQueuedDmaLocked();
}

static void nRFUsbdProcessEP0Setup(uint32_t Evt, void *pContext)
{
	(void)Evt;
	(void)pContext;

	UsbCtrlrEvt_t evt;
	evt.Type = USB_CTRLR_EVT_SETUP;

	// BMREQUESTTYPE through WLENGTHH are eight consecutive byte-wide
	// registers whose byte order is exactly the little endian layout of
	// UsbSetupData_t. Reading them in a loop beats five field combines.
	const volatile uint32_t *pReg = &NRF_USBD->BMREQUESTTYPE;
	uint8_t *pDst = (uint8_t *)&evt.Setup;
	for (int i = 0; i < 8; i++)
	{
		pDst[i] = (uint8_t)pReg[i];
	}

	while (nRFUsbdDmaActive())
	{
	}

	nRFUsbdHostResumeDetected();
	nRFUsbdAbortEp0();

	if ((evt.Setup.bmRequestType &
		 (USB_REQTYPE_MASK_RECEIPT | USB_REQTYPE_MASK_TYPE)) == 0U &&
		evt.Setup.bRequest == USB_REQ_SET_ADDRESS)
	{
		// Address and Setup share the event union; wValue is read before
		// the union is repurposed.
		const uint8_t addr = (uint8_t)(evt.Setup.wValue & 0x7FU);
		evt.Type = USB_CTRLR_EVT_ADDRESS;
		evt.Address = addr;
	}

	UsbDevProcessEvent(0, &evt);

	if (evt.Type == USB_CTRLR_EVT_SETUP &&
		(evt.Setup.bmRequestType & USB_REQTYPE_MASK_DIR) == 0U &&
		evt.Setup.wLength != 0U)
	{
		NRF_USBD->SHORTS = 0U;
		NRF_USBD->TASKS_EP0RCVOUT = 1U;
		(void)NRF_USBD->TASKS_EP0RCVOUT;
	}
}

static void nRFUsbdQueueEp0Setup(void)
{
	NRF_USBD->EVENTS_EP0SETUP = 0U;
	// A new SETUP aborts the old control transfer's completion.
	NRF_USBD->EVENTS_EP0DATADONE = 0U;
	(void)NRF_USBD->EVENTS_EP0DATADONE;
	(void)AppEvtHandlerQue(0U, NULL, nRFUsbdProcessEP0Setup);
}


extern "C" void USBD_IRQHandler(void)
{
	const uint32_t dmastatus = NRF_USBD->EPSTATUS;

	// Reset cancels any active DMA and must not wait for ENDEP.
	if (NRF_USBD->EVENTS_USBRESET != 0U)
	{
		NRF_USBD->EVENTS_USBRESET = 0U;
		nRFUsbdBusReset();
		nRFUsbdEmitSimple(USB_CTRLR_EVT_RESET);
		return;
	}

	// Exactly one endpoint can own EasyDMA. Completed cases retain its lock
	// and request the shared handoff immediately below.
	bool startDma = false;
	if (dmastatus == 0U)
	{
		// OUT data-ready may arrive while the DMA channel is idle.
		if (NRF_USBD->EVENTS_EP0DATADONE != 0U && !nRFUsbdDmaActive())
		{
			nRFUsbdDmaLock();
			startDma = true;
		}
	}
	else
	{
		const uint32_t statusBit = 31U - (uint32_t)__CLZ(dmastatus);

		if ((statusBit & 7U) != 0U) // EP1-7 IN/OUT
		{
			// IN application completion still waits for EPDATA.
			if (!nRFUsbdRetireDma(statusBit))
				return;

			if (statusBit >= 16U)
			{
				const uint8_t epNum = (uint8_t)(statusBit & 7U);
				nRFUsbEpRegisteredEvent(epNum, 0U, USB_CTRLR_EVT_XFER_CMPL,
					(uint16_t)NRF_USBD->EPOUT[epNum].AMOUNT);
			}
			startDma = true;
		}
		else if ((statusBit & 8U) != 0U) // ISO IN/OUT
		{
			startDma = nRFUsbdIsoFinishDma(dmastatus);
		}
		else if ((statusBit & 16U) != 0U) // EP0 OUT
		{
			if (NRF_USBD->EVENTS_ENDEPOUT[0] != 0U)
			{
				NRF_USBD->EVENTS_ENDEPOUT[0] = 0U;
				NRF_USBD->EPSTATUS = dmastatus;
				__DSB();

				if (NRF_USBD->EVENTS_EP0SETUP == 0U)
				{
					const uint16_t amount = (uint16_t)NRF_USBD->EPOUT[0].AMOUNT;
					// Re-arm before the core may select status or stall.
					NRF_USBD->TASKS_EP0RCVOUT = 1U;
					(void)NRF_USBD->TASKS_EP0RCVOUT;
					nRFUsbdEmitXfer(0U, amount);
				}
				startDma = true;
			}
		}
		else // EP0 IN
		{
			if (NRF_USBD->EVENTS_EP0DATADONE != 0U)
			{
				NRF_USBD->EVENTS_EP0DATADONE = 0U;
				NRF_USBD->EVENTS_ENDEPIN[0] = 0U;
				NRF_USBD->EPSTATUS = dmastatus;
				__DSB();

				if (NRF_USBD->EVENTS_EP0SETUP != 0U)
				{
					nRFUsbdDmaUnlock();
				}
				else
				{
					(void)CFifoGet(s_Usbd.hEp0Que);
					nRFEPPkt_t *p = (nRFEPPkt_t *)CFifoPeek(s_Usbd.hEp0Que);
					if (p != NULL)
						nRFUsbdEp0InStart(p);
					else
					{
						nRFUsbdEmitXfer(USB_ENDPADDR_DIR_IN, 0U);
						startDma = true;
					}
				}
			}
		}
	}

	if (startDma)
	{
		// Restart before EPDATA/SOF work; SETUP and bus events take precedence.
		if ((NRF_USBD->EVENTS_EP0SETUP | NRF_USBD->EVENTS_USBEVENT) == 0U &&
			nRFUsbdDmaAllowed())
		{
			// EP0DATADONE retains OUT readiness while another endpoint owns DMA.
			if (NRF_USBD->EVENTS_EP0DATADONE != 0U &&
				(NRF_USBD->BMREQUESTTYPE & USB_REQTYPE_MASK_DIR) == 0U)
			{
				NRF_USBD->EVENTS_EP0DATADONE = 0U;
				NRF_USBD->EPOUT[0].PTR = (uint32_t)(uintptr_t)s_Usbd.Ep0Bounce;
				NRF_USBD->EPOUT[0].MAXCNT = NRFX_USBD_MAX_PACKET_SIZE;
				nRFUsbdDmaStartLocked(&NRF_USBD->TASKS_STARTEPOUT[0],
					&NRF_USBD->EVENTS_ENDEPOUT[0]);
			}
			else
			{
				// SETUP's idle wait can be interrupted by a data submission.
				// Give its queued control response the retained channel first.
				const nRFEPPkt_t *pEp0 =
					(const nRFEPPkt_t *)CFifoPeek(s_Usbd.hEp0Que);
				if (pEp0 != NULL)
					nRFUsbdEp0InStart(pEp0);
				else
					nRFUsbdStartQueuedDma();
			}
		}
		else
			nRFUsbdDmaUnlock();
	}

