IOsonata/IOsonata/ARM/Nordic/nRF52/src/usb_ctrlr_nrf52.cpp
	if (NRF_USBD->EVENTS_USBEVENT != 0U)
	{
		NRF_USBD->EVENTS_USBEVENT = 0U;
		const uint32_t eventCause = NRF_USBD->EVENTCAUSE;
		NRF_USBD->EVENTCAUSE = eventCause;
		(void)NRF_USBD->EVENTCAUSE;

		nRFUsbdHandleBusEvent(eventCause);
	}

	if (NRF_USBD->EVENTS_EP0SETUP != 0U)
	{
		nRFUsbdQueueEp0Setup();
		return;
	}
	// Clear the event first so a new endpoint event remains observable.
	// Service at most one endpoint per direction in this interrupt.
	// Unaccepted IN completions remain available to the foreground retry.
	NRF_USBD->EVENTS_EPDATA = 0U;
	const uint32_t dataStatus = NRF_USBD->EPDATASTATUS;
	uint32_t servicedStatus = dataStatus & 0x00010001UL;

	const uint32_t inData = dataStatus & 0xFEU;
	if (inData != 0U)
	{
		servicedStatus |= nRFUsbdQueueInComplete(inData);
	}

	// Clear only serviced endpoints; keep every other status bit latched.
	// The following SOF register read completes this write.
	NRF_USBD->EPDATASTATUS = servicedStatus;

	if (NRF_USBD->EVENTS_SOF != 0U)
	{
		NRF_USBD->EVENTS_SOF = 0U;
		(void)NRF_USBD->EVENTS_SOF;

		nRFUsbdHandleSof();
	}

	nRFUsbdTryRemoteWake();

	// Queue newly received OUT data; completion already restarted pending DMA.
	const uint32_t outData = (dataStatus >> 16U) & 0xFEU;
	if (outData != 0U)
	{
		nRFUsbdProcessOutData(31U - (uint32_t)__CLZ(outData), NULL);
	}

	nRFUsbdTryEnterLowPower();

}

// Public controller API.

bool UsbCtrlrInit(int DevNo, const UsbCtrlrCfg_t *pCfg)
{
	if (DevNo != 0 || pCfg == NULL)
	{
		return false;
	}

	// Registrations, transfer state and flags all restart from zero;
	// ResetState below rebuilds what must not be zero.
	memset(&s_Usbd, 0, sizeof(s_Usbd));

	s_Usbd.IntPrio = pCfg->IntPrio;
	s_Usbd.LowPowerSuspend = pCfg->bLowPowerSuspend;

	s_Usbd.hQue = CFifoInit(s_QueMem, sizeof(s_QueMem), sizeof(nRFUsbdQue_t),
					   true);
	s_Usbd.hEp0Que = CFifoInit(s_Ep0QueMem, sizeof(s_Ep0QueMem),
						  sizeof(nRFEPPkt_t), true);

	nRFUsbdResetState();
	return true;
}

bool UsbCtrlrStart(int DevNo)
{
	if (UsbCtrlrVbusDetected(DevNo) == false)
	{
		// No cable. Not a failure: the poll in UsbdProcess reports the attach
		// and the caller comes back.
		return false;
	}

	if (UsbdXtalRequest() == false)
	{
		return false;
	}

	NVIC_SetPriority(USBD_IRQn, s_Usbd.IntPrio);

	if (UsbdStartCtrlr() == false)
	{
		UsbdXtalRelease();
		return false;
	}

	return true;
}

void UsbCtrlrStop(int DevNo)
{
	(void)DevNo;
	nRFUsbdDmaWait();
	nRFUsbdResetState();

	// Stop the controller interrupt before powering down the wrapper.
	NVIC_DisableIRQ(USBD_IRQn);

	NRF_USBD->INTEN = 0;
	NRF_USBD->USBPULLUP = 0;
	NRF_USBD->ENABLE = 0;
	(void)NRF_USBD->ENABLE;

	// A successful start owns one clock request; a failed start releases it.
	UsbdXtalRelease();
}

// Suspend and wake are owned by the USBEVENT/SOF handlers. With low-power
// suspend disabled, this driver never enters peripheral low-power mode.
void UsbCtrlrProcess(int DevNo)
{
	(void)DevNo;
	AppEvtHandlerExec();

	// Share EPDATASTATUS with the ISR without publishing a completion twice.
	const uint32_t state = DisableInterrupt();
	// Withheld OUT buffers retain receive work even if AppEvt was full.
	for (uint8_t epNum = 1U; epNum < NRFX_USBD_EP_COUNT; epNum++)
	{
		nRFUsbEpReg_t *pReg = &s_Usbd.EpReg[epNum - 1U][0];
		if (pReg->pBuffer == NULL && pReg->Handler != NULL)
		{
			pReg->Handler(USB_CTRLR_EVT_DRDY, 0U, pReg->pContext);
		}
	}
	const uint32_t inData = NRF_USBD->EPDATASTATUS & 0xFEU;
	if (inData != 0U)
	{
		NRF_USBD->EPDATASTATUS = nRFUsbdQueueInComplete(inData);
		__DSB();
	}
	uint32_t outData = (NRF_USBD->EPDATASTATUS >> 16U) & 0xFEU;
	while (outData != 0U)
	{
		const uint8_t epNum = (uint8_t)(31U - (uint32_t)__CLZ(outData));
		outData &= ~(1UL << epNum);
		// A held RX buffer must not starve another pending endpoint.
		nRFUsbdProcessOutData(epNum, NULL);
	}
	EnableInterrupt(state);
}

bool UsbCtrlrVbusDetected(int DevNo)
{
	(void)DevNo;
	return (NRF_POWER->USBREGSTATUS &
		POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0;
}

bool UsbCtrlrHighSpeed(int DevNo)
{
	(void)DevNo;
	return false;
}

size_t UsbCtrlrGetSerial(int DevNo, char *pBuff, size_t BuffLen)
{
	(void)DevNo;
	(void)BuffLen;
	uint32_t id = 0U;
	for (unsigned i = 0U; i < 16U; ++i)
	{
		if ((i & 7U) == 0U)
			id = nrf_ficr_deviceid_get(NRF_FICR, i >> 3U);
		const unsigned digit = id >> 28U;
		id <<= 4U;
		pBuff[i] = (char)(digit + (digit < 10U ? '0' : 'A' - 10));
	}
	pBuff[16] = '\0';
	return 16U;
}

void UsbCtrlrIntEnable(int DevNo)
{
	(void)DevNo;
	NVIC_EnableIRQ(USBD_IRQn);
}

void UsbCtrlrIntDisable(int DevNo)
{
	(void)DevNo;
	NVIC_DisableIRQ(USBD_IRQn);
}

void UsbCtrlrConnect(int DevNo)
{
	(void)DevNo;
	NRF_USBD->USBPULLUP = 1;
}

void UsbCtrlrDisconnect(int DevNo)
{
	(void)DevNo;
	NRF_USBD->USBPULLUP = 0;
}

void UsbCtrlrRemoteWakeup(int DevNo)
{
	(void)DevNo;
	const uint32_t state = DisableInterrupt();
	const uint8_t flags = s_Usbd.Flags;
	if ((flags & (USBD_FLAG_SUSPENDED | USBD_FLAG_HOST_RESUME)) !=
		USBD_FLAG_SUSPENDED)
	{
		EnableInterrupt(state);
		return;
	}

	s_Usbd.Flags = flags | USBD_FLAG_REMOTE_WAKE;

	UsbdForceNormal();
	nRFUsbdTryRemoteWake();
	EnableInterrupt(state);
}

void UsbCtrlrSofEnable(int DevNo, bool Enable)
{
	(void)DevNo;
	s_Usbd.SofEnabled = Enable;

	if (Enable)
	{
		nRFUsbdSofAcquire();
	}
	else
	{
		nRFUsbdSofRelease();
	}
}

void UsbCtrlrSetAddress(int DevNo, uint8_t Address)
{
	// USBD applies SET_ADDRESS in hardware.
	(void)DevNo;
	(void)Address;
}

__attribute__((weak))
bool UsbCtrlrEpOpen(int DevNo, const UsbEndPointDesc_t *pDesc)
{
	(void)DevNo;
	(void)pDesc;
	return false;
}

bool UsbCtrlrEpOpenData(int DevNo, uint8_t EpNo, bool bIn, uint8_t Type,
						 uint16_t MaxPacketSize)
{
	(void)Type;
	if (EpNo == 0U || EpNo >= NRFX_USBD_DATA_EP_COUNT ||
		MaxPacketSize == 0U || MaxPacketSize > NRFX_USBD_MAX_PACKET_SIZE)
	{
		return false;
	}

	nRFUsbGetEpReg(EpNo, bIn)->MaxPacketSize = MaxPacketSize;
	nRFUsbdEpHwEnable(EpNo, bIn, true);

	UsbCtrlrEpClearStall(DevNo, EpNo, bIn);
	return true;
}

