IOsonata/IOsonata/ARM/Nordic/nRF52/src/usb_ctrlr_nrf52.cpp
void UsbCtrlrEpClose(int DevNo, uint8_t EpNo, bool bIn)
{
	(void)DevNo;
	if (EpNo == 0U || EpNo >= NRFX_USBD_EP_COUNT)
	{
		return;
	}

	if (EpNo == NRFX_USBD_ISO_EP_NO)
	{
		nRFUsbdIsoEpClose(bIn);
		return;
	}

	nRFUsbdDmaWait();
	CFifoFlush(s_Usbd.hQue);

	nRFUsbdEpHwEnable(EpNo, bIn, false);
	NRF_USBD->EPDATASTATUS = 1UL << (EpNo + (bIn ? 0U : 16U));
	if (!bIn)
	{
		NRF_USBD->SIZE.EPOUT[EpNo] = 0;
	}
	nRFUsbGetEpReg(EpNo, bIn)->MaxPacketSize = 0U;
	__DSB();
}

void UsbCtrlrEpCloseAll(int DevNo)
{
	for (uint8_t epNum = NRFX_USBD_EP_COUNT - 1U; epNum != 0U; epNum--)
	{
		UsbCtrlrEpClose(DevNo, epNum, false);
		UsbCtrlrEpClose(DevNo, epNum, true);
	}

	NRF_USBD->EPOUTEN = 1UL;
	NRF_USBD->EPINEN = 1UL;
}

void UsbCtrlrEpAlloc(int DevNo, uint8_t EpNo, bool bIn, uint8_t *pBuffer,
					 bool bBlocking,
					 UsbCtrlrEpHandler_t Handler, void *pContext)
{
	(void)DevNo;
	nRFUsbEpReg_t *pReg = nRFUsbGetEpReg(EpNo, bIn);
	pReg->pBuffer = pBuffer;
	pReg->Handler = Handler;
	pReg->pContext = pContext;
	pReg->bBlocking = bBlocking;
}

bool UsbCtrlrEpSend(int DevNo, uint8_t EpNum, uint8_t *pBuffer,
						 uint16_t Length)
{
	(void)DevNo;
	if (EpNum == NRFX_USBD_ISO_EP_NO)
	{
		s_Usbd.EpReg[EpNum - 1U][1].pBuffer = pBuffer;
		return nRFUsbdIsoXfer(1U, Length);
	}

	bool retval = false;
	const uint32_t state = DisableInterrupt();
	nRFUsbdQue_t *pQue = (nRFUsbdQue_t *)CFifoPut(s_Usbd.hQue);

	if (pQue != nullptr)
	{
		pQue->EpNum = EpNum;
		pQue->Dir = NRFX_USBD_QUE_IN_BUFFER;
		pQue->pBuffer = pBuffer;

		const uint32_t misalign = (uint32_t)(uintptr_t)pBuffer & 3U;
		if (misalign != 0U)
		{
			const uint32_t repair = 4U - misalign;
			if (Length > repair)
			{
				Length = repair;
			}
			memcpy(&pQue->Scratch, pBuffer, Length);
			pQue->Dir = NRFX_USBD_QUE_IN_SCRATCH;
		}
		pQue->Len = Length;
		nRFUsbdResumeQueuedDmaLocked();

		retval = true;
	}

	EnableInterrupt(state);

	return retval;
}


bool UsbCtrlrEp0Status(int DevNo, uint8_t EpAddr)
{
	(void)DevNo;
	const uint32_t state = DisableInterrupt();
	// A short IN data packet may already have armed the OUT status stage.
	if (USB_ENDPADDR_IS_IN(EpAddr) ||
		(NRF_USBD->SHORTS & USBD_SHORTS_EP0DATADONE_EP0STATUS_Msk) == 0U)
	{
		NRF_USBD->TASKS_EP0STATUS = 1U;
		(void)NRF_USBD->TASKS_EP0STATUS;
	}
	EnableInterrupt(state);
	nRFUsbdEmitXfer(EpAddr, 0U);
	return true;
}

int UsbCtrlrEp0Send(int DevNo, uint8_t *pBuffer, int Length)
{
	int cnt = 0;

	(void)DevNo;
	const uint32_t state = DisableInterrupt();

	nRFEPPkt_t *p;
	do
	{
		const int l = min(Length, NRFX_USBD_MAX_PACKET_SIZE);

		p = (nRFEPPkt_t *)CFifoPut(s_Usbd.hEp0Que);
		if (p == NULL)
		{
			if (Length == 0)
				cnt = -1;
			break;
		}

		p->Len = l;
		if (l > 0)
		{
			memcpy(p->Payload, pBuffer, l);
			pBuffer += l;
		}

		Length -= l;
		cnt += l;
	} while (Length != 0);

	if (NRFX_USBD_EASYDMA_BUSY_REG == NRFX_USBD_EASYDMA_BUSY_REG_CLEAR)
	{
		nRFUsbdDmaLock();
		NRF_USBD->EVENTS_EP0DATADONE = 0U;

		nRFUsbdEp0InStart((nRFEPPkt_t *)CFifoPeek(s_Usbd.hEp0Que));
	}
	EnableInterrupt(state);

	return cnt;
}

void UsbCtrlrEpStall(int DevNo, uint8_t EpNo, bool bIn)
{
	(void)DevNo;
	if (EpNo >= NRFX_USBD_DATA_EP_COUNT)
	{
		return;
	}

	if (EpNo == 0U)
	{
		NRF_USBD->TASKS_EP0STALL = 1;
		(void)NRF_USBD->TASKS_EP0STALL;
	}
	else
	{
		const uint8_t epAddr = (uint8_t)(EpNo |
			(bIn ? USB_ENDPADDR_DIR_IN : 0U));
		NRF_USBD->EPSTALL =
			(USBD_EPSTALL_STALL_Stall << USBD_EPSTALL_STALL_Pos) | epAddr;
	}
}

void UsbCtrlrEpClearStall(int DevNo, uint8_t EpNo, bool bIn)
{
	(void)DevNo;
	if (EpNo == 0U || EpNo >= NRFX_USBD_DATA_EP_COUNT)
	{
		return;
	}

	const uint8_t epAddr = (uint8_t)(EpNo |
		(bIn ? USB_ENDPADDR_DIR_IN : 0U));
	NRF_USBD->DTOGGLE = epAddr;
	NRF_USBD->DTOGGLE =
		(USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) | epAddr;
	NRF_USBD->EPSTALL =
		(USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) | epAddr;

	if (!bIn)
	{
		NRF_USBD->SIZE.EPOUT[EpNo] = 0;
	}
}
